node {
  name: "input_processing/batch_processing/IteratorV2"
  op: "IteratorV2"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@input_processing/batch_processing/MakeIterator"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 224
          }
          dim {
            size: 224
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT32
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "input_processing/batch_processing/Const"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "/cpu:0"
      }
    }
  }
}
node {
  name: "input_processing/batch_processing/MultiDeviceIterator"
  op: "MultiDeviceIterator"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "devices"
    value {
      list {
        s: "/gpu:0"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 224
          }
          dim {
            size: 224
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT32
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "input_processing/batch_processing/optimizations"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 3
          }
        }
        string_val: "map_and_batch_fusion"
        string_val: "noop_elimination"
        string_val: "shuffle_and_repeat_fusion"
      }
    }
  }
}
node {
  name: "input_processing/batch_processing/ExperimentalThreadPoolHandle"
  op: "ExperimentalThreadPoolHandle"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "display_name"
    value {
      s: "input_pipeline_thread_pool"
    }
  }
  attr {
    key: "max_intra_op_parallelism"
    value {
      i: 1
    }
  }
  attr {
    key: "num_threads"
    value {
      i: 108
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "input_processing/batch_processing/drop_remainder"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "_ngraph_backend"
    value {
      s: "CPU"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: false
      }
    }
  }
}
node {
  name: "input_processing/batch_processing/num_parallel_calls"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "_ngraph_backend"
    value {
      s: "CPU"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 128
      }
    }
  }
}
node {
  name: "input_processing/batch_processing/count_1"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "_ngraph_backend"
    value {
      s: "CPU"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "input_processing/batch_processing/seed2"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "_ngraph_backend"
    value {
      s: "CPU"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        tensor_content: "6\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "input_processing/batch_processing/seed"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "_ngraph_backend"
    value {
      s: "CPU"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 1234
      }
    }
  }
}
node {
  name: "input_processing/batch_processing/buffer_size_1"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "_ngraph_backend"
    value {
      s: "CPU"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 10000
      }
    }
  }
}
node {
  name: "input_processing/batch_processing/start"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "_ngraph_backend"
    value {
      s: "CPU"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "input_processing/batch_processing/prefetch_input_elements"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "_ngraph_backend"
    value {
      s: "CPU"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 20
      }
    }
  }
}
node {
  name: "input_processing/batch_processing/buffer_output_elements"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "_ngraph_backend"
    value {
      s: "CPU"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 2
      }
    }
  }
}
node {
  name: "input_processing/batch_processing/cycle_length"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "_ngraph_backend"
    value {
      s: "CPU"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 10
      }
    }
  }
}
node {
  name: "input_processing/batch_processing/list_files/seed2"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "_ngraph_backend"
    value {
      s: "CPU"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        tensor_content: "\033\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "input_processing/batch_processing/list_files/file_pattern"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1024
          }
        }
        string_val: "/dataset/TF_ImageNet_latest/train-00714-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00419-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00023-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00321-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00416-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00975-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00849-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00110-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00627-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00846-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00525-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00993-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00628-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00212-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00092-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00670-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00147-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00811-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00390-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00245-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00148-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00572-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00074-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00379-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00743-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00696-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00441-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00376-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00699-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00922-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00594-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00965-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00331-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00406-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00704-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00409-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00033-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00535-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00983-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00638-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00202-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00856-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00100-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00637-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00859-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00255-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00158-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00562-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00801-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00380-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00660-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00157-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00082-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00689-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00932-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00584-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00451-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00366-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00686-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00064-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00369-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00753-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00866-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00232-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00608-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00505-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00869-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00607-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00130-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00436-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00301-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00880-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00955-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-01008-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00003-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00439-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00734-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-01007-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00356-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00461-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00283-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00902-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00763-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00359-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00054-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00181-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00831-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00487-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00552-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00168-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00265-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00785-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00488-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00167-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00650-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00617-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00120-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00879-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00222-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00618-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00515-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00876-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-01017-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00013-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00429-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00724-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00945-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-01018-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00426-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00311-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00890-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00191-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00773-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00349-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00044-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00293-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00912-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00346-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00471-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00177-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00640-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00795-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00498-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00542-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00178-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00275-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00821-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00497-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00034-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00339-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00703-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00962-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00401-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00336-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00630-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00107-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00984-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00205-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00108-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00532-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00851-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00150-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00667-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00388-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00809-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00085-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00565-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00668-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00252-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00806-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00387-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00681-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00754-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00459-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00063-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00583-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00935-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00361-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00456-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00411-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00326-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00972-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00024-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00329-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00713-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-01020-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00841-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00994-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00215-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00118-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00522-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00620-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00117-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00816-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00397-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00575-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00678-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00242-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00398-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00819-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00095-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00140-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00677-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00371-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00446-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00593-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00925-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00744-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00449-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00073-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00691-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00512-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00128-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00225-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00871-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00127-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00610-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00942-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00316-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00897-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00421-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-01010-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00723-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00898-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00319-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00014-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00294-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00915-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00199-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00476-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00341-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00196-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00043-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00479-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00774-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00272-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00648-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00545-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00490-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00826-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00647-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00170-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00829-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00792-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00137-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00600-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00861-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00502-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00138-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00235-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00733-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00888-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00309-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00004-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-01000-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00306-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00887-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00431-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00952-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00053-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00469-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00764-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00186-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00466-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00351-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00284-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00905-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00189-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00839-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00782-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00657-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00160-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00480-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00836-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00262-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00658-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00555-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-01006-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00735-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00002-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00438-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-01009-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00954-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00300-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00881-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00437-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00131-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00606-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00868-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00504-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00233-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00609-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00867-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00651-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00166-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00489-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00784-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00264-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00553-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00169-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00486-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00830-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00180-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00055-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00762-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00358-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00282-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00903-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00460-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00357-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00310-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00891-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00427-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-01019-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00944-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00725-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00012-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00428-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-01016-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00877-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00514-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00223-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00619-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00878-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00121-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00616-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00496-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00820-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00274-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00543-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00179-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00499-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00794-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00641-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00176-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00470-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00347-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00292-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00913-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00045-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00772-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00348-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00190-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00629-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00992-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00213-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00524-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00847-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00626-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00111-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00848-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00974-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00417-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00320-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00418-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00022-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00715-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00595-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00923-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00698-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00377-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00440-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00697-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00378-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00742-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00075-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00149-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00573-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00244-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00810-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00391-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00146-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00671-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00093-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00858-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00636-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00101-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00857-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00639-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00982-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00203-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00534-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00408-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00032-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00705-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00407-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00330-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00964-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00368-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00752-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00065-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00687-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00367-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00450-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00585-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00933-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00688-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00083-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00156-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00661-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00800-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00381-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00159-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00563-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00254-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00015-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00899-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00722-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00318-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-01011-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00420-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00317-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00896-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00943-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00611-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00126-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00870-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00224-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00513-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00129-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00793-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00828-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00171-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00646-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00827-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00491-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00544-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00273-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00649-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00775-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00042-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00478-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00197-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00340-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00477-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00198-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00295-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00914-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00953-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00430-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00307-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00886-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-01001-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00005-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00889-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00732-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00308-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00234-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00503-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00139-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00860-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00601-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00136-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00554-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00263-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00659-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00837-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00481-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00161-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00656-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00783-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00838-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00188-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00285-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00904-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00350-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00467-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00187-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00765-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00052-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00468-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00850-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00109-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00533-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00985-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00204-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00106-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00631-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00337-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00400-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00963-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00338-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00702-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00035-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00457-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00360-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00934-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00582-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00458-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00062-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00755-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00680-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00807-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00386-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00669-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00253-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00564-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00084-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00389-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00808-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00666-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00151-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00116-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00621-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00119-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00523-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00995-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00214-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00840-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-01021-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00328-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00712-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00025-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00973-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00327-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00410-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00690-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00448-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00072-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00745-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00924-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00592-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00447-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00370-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00676-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00141-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00094-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00399-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00818-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00679-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00243-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00574-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00817-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00396-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00454-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00759-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00363-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00937-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00581-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00061-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00756-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00683-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00938-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00088-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00804-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00385-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00250-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00567-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00087-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00665-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00568-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00152-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00853-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00530-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00986-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00207-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00105-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00208-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00989-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00632-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00334-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00039-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00403-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00960-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00701-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00036-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00693-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00928-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00071-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00746-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00927-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00591-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00444-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00749-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00373-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00675-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00578-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00142-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00097-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00240-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00577-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00098-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00814-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00395-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00115-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00218-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00999-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00622-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00520-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00996-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00217-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00843-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-01022-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00711-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00026-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00970-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00324-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00029-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00413-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00790-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00172-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00548-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00645-of-01024"
        string_val: "/dataset/TF_ImageNet_latest/train-00824-of-01024"
